namespace Switching_Programme_for_110_kV_Tie_Line.Receivers;


// Представляє окремий вузол (ділянку) електричної схеми.
// Це може бути як шинне розгалуження розвілка, так і ввід лінії
// або місце встановлення заземлення.
public class ElectricNode(string name)
{
    public string Name { get; } = name;  // наприклад, "Ввід ПЛ 110 кВ"

    // Стан наявності напруги. 
    // True — якщо на вузол подано напругу через увімкнені комутаційні апарати.
    // Використовується для перевірки безпеки перед увімкненням заземлення.
    public bool HasVoltage { get; set; }

    // Стан заземлення вузла.
    // True — якщо на цій ділянці увімкнені заземлювальні ножі (ЗН)
    // або накладено переносне заземлення.
    // Це критичний показник: увімкнення на заземлений вузол призведе до КЗ!
    public bool IsGrounded { get; set; }
}
