namespace Switching_Programme_for_110_kV_Tie_Line.Enums;


// Типи високовольтних комутаційних апаратів: захист (CircuitBreaker),
// ізоляція (Disconnector), безпека (EarthingSwitch)
public enum DeviceType
{
    CircuitBreaker, // Вимикач: основний апарат для комутації навантаження
                    // та струмів короткого замикання (КЗ).
                    // Має дугогасильну систему, здатний швидко відключати
                    // лінію в разі аварії.
                    // Використовується для релейного захисту, автоматики й
                    // оперативного керування.

    Disconnector,   // Роз'єднувач: апарат, що створює видимий розрив у колі.
                    // Не призначений для комутації навантаження чи струмів КЗ.
                    // Використовується для убезпечення ремонтних робіт.
                    // Дає персоналу візуальне підтвердження відключення.

    EarthingSwitch  // Заземлювальний ніж роз'єднувача (заземлювач).
                    // Призначений для заземлення відключеної ділянки лінії
                    // або обладнання (створює КЗ на включеній ділянці).
                    // Захищає персонал від випадкової подачі напруги.
                    // Використовується в комплекті з головними ножами
                    // роз'єднувача для повної безпеки.
}