using Switching_Programme_for_110_kV_Tie_Line.Enums;
using Switching_Programme_for_110_kV_Tie_Line.Receivers;

namespace Switching_Programme_for_110_kV_Tie_Line.Commands;


/*
      7.4. Перевірка відсутності напруги
     7.4.1. Перевіряти  відсутність  напруги  необхідно покажчиком 
напруги,  справність якого перед застосуванням слід перевірити або 
за  допомогою призначених для цієї мети спеціальних приладів,  або 
наближенням до струмовідних частин, розташованих поблизу, які явно 
перебувають під напругою.  Придатність покажчиків із самоконтролем 
перевіряється наявністю звукового чи світлового сигналу.
     В електроустановках   понад   1000   В   слід   користуватись 
покажчиком напруги, застосовуючи діелектричні рукавички.
     На одноколових   ПЛ   330   кВ   і  вище  достатньою  ознакою 
відсутності напруги є відсутність коронування.

     7.4.3. Перевіряти  відсутність  напруги  вивірянням  схеми  в 
натурі дозволяється:
     -  у  ВРУ,  КРУ  і  КТП зовнішньої установки, на ПЛ - під час 
туману,  дощу, снігопаду у разі відсутності спеціальних покажчиків 
напруги,  а  також  у КРУ з викочуваними візками перед увімкненням 
заземлювальних  ножів;

     - у ВРУ 330 кВ і вище та на двоколових ПЛ 330 кВ і вище.
     У разі вивіряння схеми в натурі відсутність напруги на вводах 
ПЛ  та  КЛ  повинна  підтверджуватись  черговим,  в   оперативному 
управлінні якого знаходиться лінія.
     На ПЛ вивіряння схеми в натурі полягає у  перевірці  напрямку 
та зовнішніх ознак ліній, а також позначень на опорах, які повинні 
відповідати диспетчерським найменуванням ліній.

     7.4.5. На  ПЛ  у  разі підвішування проводів на різних рівнях 
необхідно   перевіряти   відсутність   напруги    покажчиком    та 
встановлювати   заземлення   пофазно,  знизу  вверх,  починаючи  з 
нижнього проводу.  У разі  горизонтального  підвішування  проводів 
перевірку слід починати з найближчого проводу.

     7.4.7. Пристрої,   що  сигналізують  про  вимкнене  положення 
апарата,  блокувальні пристрої, постійно ввімкнені вольтметри тощо 
є  тільки  допоміжними  засобами,  які  підтверджують  відсутність 
напруги,  і на підставі їхніх показів не можна робити висновок про 
відсутність напруги. 
*/
// https://zakon.rada.gov.ua/laws/show/z0011-98#Text


public class CheckVoltageCommand(
    ElectricNode node,
    string description,
    OperationalState expectedState = OperationalState.Isolated)
    : ISwitchOperation
{
    private readonly ElectricNode _node = node;
    private readonly string _description = description;
    private readonly OperationalState _expectedState = expectedState;

    public void Execute()
    {
        Console.WriteLine($"{DateTime.Now:dd.MM.yyyy HH:mm:ss.fffff} " +
            $"ПЕРЕВІРКА ВІДСУТНОСТІ НАПРУГИ: {_description}... ");

        // Імітація роботи покажчика напруги (ПБЕЕ п. 7.4.1).
        // Достатньо лише захисту від увімкнення на КЗ:
        if (_node.HasVoltage && _expectedState == OperationalState.Isolated)
        {
            Console.WriteLine($"{DateTime.Now:dd.MM.yyyy HH:mm:ss.fffff} " +
                $"КРИТИЧНА ПОМИЛКА! Виявлено напругу {_node.Name}! " +
                $"Операцію зупинено!");
            throw new InvalidOperationException($"Ризик увімкнення на КЗ!");
        }
        else
        {
            Console.WriteLine($"{DateTime.Now:dd.MM.yyyy HH:mm:ss.fffff} " +
                $"ПІДТВЕРДЖЕНО: напруга {_node.Name} відсутня. " +
                $"Дозволено вмикати ЗН на цій ділянці.");
        }
    }


    public void Undo()
    {
        // Перевірка напруги — це незворотна інформаційна дія,
        // скасування не потрібне
    }
}